Tekla Open API Reference for Tekla Structures 2025
WindowBase.UpdateDataStorageFromViewModel Method
 DO NOT USE! For internal usage only!
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void UpdateDataStorageFromViewModel(
	Object viewModelClass
)
Public Sub UpdateDataStorageFromViewModel (
	viewModelClass As Object
)
Parameters
viewModelClass
Type: System.Object
[Missing <param name="viewModelClass"/> documentation for "M:Tekla.Structures.Dialog.WindowBase.UpdateDataStorageFromViewModel(System.Object)"]
See Also
Reference
WindowBase Class
Tekla.Structures.Dialog Namespace